- pandas常用类
    - Series
    - DataFrame

   - values :一组数据

   - index :相关索引

In [6]:
from pandas import Series
s = Series(data=[1,2,3,'four'])
s

0       1
1       2
2       3
3    four
dtype: object

In [7]:
import numpy as np
s = Series(data=np.random.randint(0,100,size=(3,)))
s

0    66
1    21
2    30
dtype: int32

In [37]:
#index用来指定显示索引
s = Series(data=[1,2,3,'four'],index=['a','b','c','d'])
s

a       1
b       2
c       3
d    four
dtype: object

In [18]:
#为什么需要有显示索引
#显示索引可以增强Series的可读性

In [20]:
dic = {
    '语文':100,
    '数学':99,
    '理综':250,
}
s = Series(data=dic)
s

语文    100
数学     99
理综    250
dtype: int64

Series的索引和切片

In [30]:
s[0]
s.语文
s[0:2]

语文    100
数学     99
dtype: int64

*Series的常用属性

    -shape
    -size
    -index
    -values

In [40]:
s.shape
s.size
s.index #返回索引
s.values #返回值
s.dtype #返回元素类型

dtype('O')

In [35]:
s = Series(data=[1,2,3,'four'],index=['a','b','c','d'])
s.dtype #数据类型O表示的是object(字符串类型)

dtype('O')

Series的常用方法

    -head(),tail()
    -unique()
    -isnull(),notnull()
    -add(),sub(),mul(),div()

In [23]:
s = Series(data=np.random.randint(60,100,size=(10,)))
s.head(3) #显示前n个数据

0    79
1    74
2    95
dtype: int32

In [44]:
s.tail(3) #显示后n个元素

7    70
8    63
9    72
dtype: int32

In [45]:
s.unique() #去重

array([98, 66, 81, 87, 75, 76, 65, 70, 63, 72])

In [46]:
s.isnull() #用于判断每一个元素是否为空，为空返回True，否则返回False

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

- Series的算数运算
    - 法则:索引一致的元素进行算法运算否则补空

In [47]:
s1 = Series(data=[1,2,3],index=['a','b','c'])
s2 = Series(data=[1,2,3],index=['a','d','c'])
s = s1 + s2
s

a    2.0
b    NaN
c    6.0
d    NaN
dtype: float64

In [49]:
s.isnull()

a    False
b     True
c    False
d     True
dtype: bool

- DataFrame
    - 行索引:index
    - 列索引:columns
    - 值:values

- DataFrame的创建
    - ndarray创建
    - 字典创建

In [2]:
from pandas import DataFrame

In [3]:
df = DataFrame(data=[[1,2,3],[4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [9]:
df = DataFrame(data=np.random.randint(0,100,size=(6,4)))
df

    0   1   2   3
0  53  62  38   2
1  10  92  62  75
2   8  35  21  84
3  69  45  76  93
4  82  15  50  37
5  32   1  67  33

In [12]:
dic = {
    'name':['zhangsan','lisi','wanglaowu'],
    'salary':[1000,2000,3000]
}
df = DataFrame(data=dic,index=['a','b','c'])
df

        name  salary
a   zhangsan    1000
b       lisi    2000
c  wanglaowu    3000

- DataFrame的属性
    - values、columns、index、shape

In [19]:
df.values
df.columns
df.index
df.shape

(3, 2)

In [20]:
dic = {
    '张三':[150,150,150,150],
    '李四':[0,0,0,0]
}
df = DataFrame(data=dic,index=['语文','数学','英语','理综'])
df

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  150   0

In [25]:
df = DataFrame(data=np.random.randint(60,100,size=(8,4)),columns=['a','b','c','d'])
df

    a   b   c   d
0  99  73  75  95
1  92  77  71  84
2  82  65  63  73
3  87  89  89  72
4  83  65  73  76
5  68  96  62  63
6  86  91  95  78
7  76  96  83  73

In [28]:
df['a'] #取单列,如果df有显示的索引，通过索引机制去行或者列的时候只可以使用显示索引

0    99
1    92
2    82
3    87
4    83
5    68
6    86
7    76
Name: a, dtype: int32

In [31]:
df[['a','c']] #取多列

    a   c
0  99  75
1  92  71
2  82  63
3  87  89
4  83  73
5  68  62
6  86  95
7  76  83

- iloc:
    - 通过隐式索引取行
- loc:
    - 通过显示索引取行

In [32]:
#取单行
df.iloc[0]

a    99
b    73
c    75
d    95
Name: 0, dtype: int32

In [33]:
#取多行
df.iloc[[0,3,5]]

    a   b   c   d
0  99  73  75  95
3  87  89  89  72
5  68  96  62  63

In [36]:
#取单个元素
df.iloc[0,3] 
df.loc[0,'a']

99

In [37]:
#去多个元素
df.iloc[[1,3,5],2]

1    71
3    89
5    62
Name: c, dtype: int32

- DataFrame的切片操作
    - 对行进行切片
    - 对列进行切片

In [38]:
#切行
df[0:2]

    a   b   c   d
0  99  73  75  95
1  92  77  71  84

In [41]:
#切列
df.iloc[:,0:2]

    a   b
0  99  73
1  92  77
2  82  65
3  87  89
4  83  65
5  68  96
6  86  91
7  76  96

- df索引和切片操作
    - 索引:
        - df[columns]:取列
        - df[index]:取行
        - df.iloc[index,col]:去元素
    - 切片:
        - df[index1:index3]:切行
        - df.iloc[:,col:col3]:切行

 - DataFrame的运算
    - 同Series

In [45]:
dic = {
    '张三':[150,150,150,150],
    '李四':[0,0,0,0]
}
df = DataFrame(data=dic,index=['语文','数学','英语','理综'])
qizhong = df
qimo = df

In [51]:
(qizhong + qimo) / 2 #期中期末的平均值

       张三   李四
语文  150.0  0.0
数学  150.0  0.0
英语  150.0  0.0
理综  150.0  0.0

In [56]:
qizhong.loc['数学','张三'] = 0
qizhong #将张三的数学成绩修改为0

     张三  李四
语文  150   0
数学    0   0
英语  150   0
理综  150   0

In [66]:
#将李四的所有的成绩+100
qizhong.loc[:,'李四'] += 100
qizhong

     张三   李四
语文  150  100
数学    0  100
英语  150  100
理综  150  100

In [67]:
qizhong.loc[:,:] += 10
qizhong #将所有的学生的成绩+10

     张三   李四
语文  160  110
数学   10  110
英语  160  110
理综  160  110

- 时间数据类型的转换
    - pd.to_datetime(col)
- 将某一列设置为行索引
    - df.set_index()

In [70]:
dic = {
    'time':['2010-10-10','2011-11-20','2020-01-10'],
    'temp':[33,31,30]
}
df = DataFrame(data=dic)
df

         time  temp
0  2010-10-10    33
1  2011-11-20    31
2  2020-01-10    30

In [71]:
#查看time列的类型
df['time'].dtype

dtype('O')

In [72]:
import pandas as pd

In [73]:
#将time列的数据类型转换成时间序列类型
df['time'] = pd.to_datetime(df['time'])
df

        time  temp
0 2010-10-10    33
1 2011-11-20    31
2 2020-01-10    30

In [75]:
df['time']

0   2010-10-10
1   2011-11-20
2   2020-01-10
Name: time, dtype: datetime64[ns]

In [82]:
#将time列作为源数据的行索引
df.set_index('time',inplace=True)

In [79]:
df

            temp
time
2010-10-10    33
2011-11-20    31
2020-01-10    30